namespace PcMainCtrl.Model
{
    /// <summary>
    /// 部件类型
    /// </summary>
    public enum PartsType
    {
        车体排障器 = 0x0101,
        BALISE天线 = 0x0201,
        STM天线 = 0x0202,
        砂箱 = 0x0301,
        制动轮盘 = 0x0401,
        制动轴盘 = 0x0402,
        轮轴 = 0x0501,
        制动夹钳 = 0x0601,
        牵引拉杆 = 0x0701,
        抗侧滚扭杆装置 = 0x1001,
        转向架构架 = 0x1201,
        防滑阀管线 = 0x1302,
        安装管线 = 0x1401,
        防雪风挡 = 0x1601,
        内风挡 = 0x1701,
        密接车钩 = 0x1901,
        齿轮箱 = 0x2001,
        接地装置 = 0x2004,
        牵引电动机 = 0x2101,
        传感器分线盒 = 0x2401,
        车头下底板 = 0x2601,
        ATP底板 = 0x2602,
        司机室空调底板 = 0x2603,
        空调冷凝器底板 = 0x2604,
        空调蒸发器底板 = 0x2605,
        辅助整流器箱底板 = 0x2606,
        牵引变流器底板 = 0x2607,
        污物箱底板 = 0x2608,
        换气装置底板 = 0x2609,
        水箱底板 = 0x2610,
        蓄电池箱底板 = 0x2611,
        高压机器箱底板 = 0x2612,
        牵引变压器底板 = 0x2613,
        制动单元BCU底板 = 0x2614,
        辅助空压机底板 = 0x2615,
        主空压机底板 = 0x2616,
        车头罩 = 0x2701
    }
}
